In [1]:
import pandas as pd

In [2]:
sessions = pd.read_csv("sessions.csv")
sessions

        Unnamed: 0  SessionId  ItemId        Time  Reward
0            15903       8869   11115  1023840000     1.0
1            15679       8869   10805  1024185600     1.0
2            15740       8869    4100  1024185600     1.0
3            25472       3200    6816  1036627200     1.0
4             5597       8869    5732  1052611200     1.0
...            ...        ...     ...         ...     ...
198497     2018747       1799    8280  1406073600     1.0
198498      335263      13106   10877  1406073600     1.0
198499     1120468      13106    1889  1406073600     1.0
198500     2022984      21800    7057  1406073600     1.0
198501     2021487      10353   10988  1406073600     1.0

[198502 rows x 5 columns]

In [3]:
sessions["Time"] = pd.to_datetime(sessions["Time"], unit="s")
sessions

        Unnamed: 0  SessionId  ItemId       Time  Reward
0            15903       8869   11115 2002-06-12     1.0
1            15679       8869   10805 2002-06-16     1.0
2            15740       8869    4100 2002-06-16     1.0
3            25472       3200    6816 2002-11-07     1.0
4             5597       8869    5732 2003-05-11     1.0
...            ...        ...     ...        ...     ...
198497     2018747       1799    8280 2014-07-23     1.0
198498      335263      13106   10877 2014-07-23     1.0
198499     1120468      13106    1889 2014-07-23     1.0
198500     2022984      21800    7057 2014-07-23     1.0
198501     2021487      10353   10988 2014-07-23     1.0

[198502 rows x 5 columns]

In [4]:
sessions["Time"] = sessions["Time"].dt.strftime("%Y-%m-%d %H:%M:%S.%f")
sessions

        Unnamed: 0  SessionId  ItemId                        Time  Reward
0            15903       8869   11115  2002-06-12 00:00:00.000000     1.0
1            15679       8869   10805  2002-06-16 00:00:00.000000     1.0
2            15740       8869    4100  2002-06-16 00:00:00.000000     1.0
3            25472       3200    6816  2002-11-07 00:00:00.000000     1.0
4             5597       8869    5732  2003-05-11 00:00:00.000000     1.0
...            ...        ...     ...                         ...     ...
198497     2018747       1799    8280  2014-07-23 00:00:00.000000     1.0
198498      335263      13106   10877  2014-07-23 00:00:00.000000     1.0
198499     1120468      13106    1889  2014-07-23 00:00:00.000000     1.0
198500     2022984      21800    7057  2014-07-23 00:00:00.000000     1.0
198501     2021487      10353   10988  2014-07-23 00:00:00.000000     1.0

[198502 rows x 5 columns]

In [5]:
sessions.to_csv("formatted_sessions.csv", index=False)